// Подключение заголовочных файлов
#include "stdafx.h" // эта директива всегда должна быть первой
#define M_PI 3.14159265358979323846 // Константа Пи
#define M_E  2.71828182845904523536 // Константа е
#include <cmath> // в любом файле срр для матеманических функций sqrt(), exp(), sin()
#include <iostream> // ввод/вывод
#include <iomanip> // для манипуляторов

//////////////////////////////////////////////////
// Вычисляет первую функцию
double Function1(double arg)
{
	double F1;
	F1=2*tan(abs(arg)+5)+sin(3*arg)+7/9;
	return F1;
}

//////////////////////////////////////////////////
// Вычисляет вторую функцию 
double Function2(double x)
{
	return M_E*cos(M_PI*x/2+3*x)+1.576+pow(10, -2)*pow(x, 3*x/2)+1/175;
}

//////////////////////////////////////////////////
// Выводит результаты расчета на экран монитора
void PrintData(double F1, double F2)
{
	using namespace std;

	cout << "\nРезультаты:" << endl;
	cout << setprecision(16); // устанавливаем точность вывода
	cout << "Значение первой функции: " << F1 << endl;
	cout << "Значение второй функции: " << F2 << endl;
}

